In [15]:
import pandas as pd
import numpy as np
score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],[4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],[7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],[10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],[13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])
score_df

    student_id  math_score  english_score  chinese_score   sex  class
0            1          50             80             70   boy      1
1            2          60             45             50   boy      2
2            3          98             43             55   boy      1
3            4          70             69             89   boy      2
4            5          56             79             60  girl      1
5            6          60             68             55  girl      2
6            7          45             70             77  girl      1
7            8          55             77             76  girl      2
8            9          25             57             60  girl      1
9           10          88             40             43  girl      3
10          11          25             60             45   boy      3
11          12          80             60             23   boy      3
12          13          20             90             66  girl      3
13          14          50             50             50  girl      3
14          15          89             67             77  girl      3

In [16]:
score_df.set_index(["sex","class","student_id"] , inplace=True)

In [17]:
score_df

                       math_score  english_score  chinese_score
sex  class student_id
boy  1     1                   50             80             70
     2     2                   60             45             50
     1     3                   98             43             55
     2     4                   70             69             89
girl 1     5                   56             79             60
     2     6                   60             68             55
     1     7                   45             70             77
     2     8                   55             77             76
     1     9                   25             57             60
     3     10                  88             40             43
boy  3     11                  25             60             45
           12                  80             60             23
girl 3     13                  20             90             66
           14                  50             50             50
           15                  89             67             77

In [20]:
score_df.reset_index(inplace=True)
score_df

     sex  class  student_id  math_score  english_score  chinese_score
0    boy      1           1          50             80             70
1    boy      2           2          60             45             50
2    boy      1           3          98             43             55
3    boy      2           4          70             69             89
4   girl      1           5          56             79             60
5   girl      2           6          60             68             55
6   girl      1           7          45             70             77
7   girl      2           8          55             77             76
8   girl      1           9          25             57             60
9   girl      3          10          88             40             43
10   boy      3          11          25             60             45
11   boy      3          12          80             60             23
12  girl      3          13          20             90             66
13  girl      3          14          50             50             50
14  girl      3          15          89             67             77

In [21]:
##將索引(index)依序改為sex、class、student_id，欄位依序改成chinese_score、english_score、math_score
score_df.set_index(["chinese_score","english_score","math_score"] , inplace=True)

In [22]:
score_df

                                         sex  class  student_id
chinese_score english_score math_score
70            80            50           boy      1           1
50            45            60           boy      2           2
55            43            98           boy      1           3
89            69            70           boy      2           4
60            79            56          girl      1           5
55            68            60          girl      2           6
77            70            45          girl      1           7
76            77            55          girl      2           8
60            57            25          girl      1           9
43            40            88          girl      3          10
45            60            25           boy      3          11
23            60            80           boy      3          12
66            90            20          girl      3          13
50            50            50          girl      3          14
77            67            89          girl      3          15